//{---------------------------------
//! @file auxiliary_elements.h
//{---------------------------------

#ifndef AUXILIARY_ELEMENTS_H
#define AUXILIARY_ELEMENTS_H

//{----------------------------------------------------------------------------
//! \brief константа, означающая бесконечное количество корней
//}----------------------------------------------------------------------------

const int INFINITY_SOL = -1;

//{----------------------------------------------------------------------------
//! \brief константа, означающая погрешность сравнивания чисел double
//}----------------------------------------------------------------------------

const double ACCURACY = 0.0001;

//{----------------------------------------------------------------------------
//! \brief Функция производит сравнивание двух чисел типа double
//
//! \param [in] a первое число типа double
//! \param [in] b второе число типа double
//
//! \return true, если числа равны, false, если числа не равны
//! \warning Функция возвращает значение true, если сравниваются числа NAN и Inf
//}----------------------------------------------------------------------------

bool Compare_Double (double a, double b);

//{----------------------------------------------------------------------------
//! \brief Функция очищает буфер
//}----------------------------------------------------------------------------

void Clear_Buf();

#endif
