//{---------------------------------
//! @file input_output.h
//{---------------------------------

#ifndef INPUT_OUNPUT_H
#define INPUT_OUNPUT_H

//{----------------------------------------------------------------------------
//! \brief Функция печатает решения квадртаного уравнения
//
//! \param [in] num_solutions количество корней уравнения
//! \param [in] solutions[]   массив корней квадратного уравнения
//}----------------------------------------------------------------------------

void Print_Square_Data (int num_solutions, double solutions[]);

//{----------------------------------------------------------------------------
//! \brief Функция считывает коэффициенты квадратного уравения, вводимые с клавиатуры
//
//! \param [in] a указатель на коэффициент a
//! \param [in] b указатель на коэффициент b
//! \param [in] c указатель на коэффициент c
//}----------------------------------------------------------------------------

void Scan_Square_Data (double* a, double* b, double* c);

//{----------------------------------------------------------------------------
//! \brief Функция считывает коэффицикнты линейного уравнения, вводимые с клавиатуры

//! \param [in] b указатель на коэффициент при x
//! \param [in] c указатель свободный член
//}----------------------------------------------------------------------------

void Scan_Line_Data (double* b, double* c);

//{----------------------------------------------------------------------------
//! \brief Функция печатает решение линейного уравнения

//! \param [in] num_solutions количество корней уравнения
//! \param [in] solution      указатель на решение уравнения
//}----------------------------------------------------------------------------

void Print_Line_Data (int num_solutions, double* solution);

#endif
