//{------------------------------
//! @file SquareTesting.h
//}-----------------------------

#ifndef SQUARETESTING_H
#define SQUARETESTING_H

//{----------------------------------------------------------------------------
//! \brief  Функция тестирует работу функции Solve_Square_Eq, вызывая несколько
//! \brief  раз функцию Unit_Test с разными параметрами и выводит диагностику
//! \brief  непройденных тестов
//
//! \return количество пройденных тестов
//}----------------------------------------------------------------------------

int Unit_Test (double a, double b, double c, int true_num_solutions,
               double true_x1, double true_x2, int test_number);

//{-----------------------------------------------------------------------------------
//! \brief Функция производит ряд тестов функции Solve_Square_Eq на данных из файла
//! \brief file

//! \param [in] file указатель на файл, из которого читается информация

//! \return количество пройденных тестов. Также выводит диагностику непройденных тестов
//}-----------------------------------------------------------------------------------

int File_Unit_Test (FILE* file);

#endif
